; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 792649 2 2 4 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph3 - mode
	spectrograph1 - mode
	image0 - mode
	infrared2 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	Star0 - direction
	GroundStation3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument2 spectrograph1)
	(supports instrument2 image0)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite1 Phenomenon4)
	(have_image Phenomenon4 image0)
	(have_image Star5 infrared2)
	(have_image Phenomenon6 spectrograph1)
	(have_image Star7 image0)
	(have_image Star8 image0)
	(have_image Phenomenon9 thermograph3)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 star5 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star5)
   goals met: 0 of 7
4. (turn_to satellite1 star0 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star0)
   goals met: 0 of 7
5. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 7
6. (turn_to satellite0 groundstation3 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 7
7. (turn_to satellite1 phenomenon4 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon4)
   goals met: 1 of 7
8. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 7
9. (take_image satellite1 phenomenon4 instrument2 image0)
   added: (have_image phenomenon4 image0)
   goals met: 2 of 7
10. (turn_to satellite0 star8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star8)
   goals met: 2 of 7
11. (take_image satellite0 star8 instrument0 image0)
   added: (have_image star8 image0)
   goals met: 3 of 7
12. (turn_to satellite1 star7 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 star7)
   goals met: 2 of 7
13. (turn_to satellite0 star5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star5)
   goals met: 2 of 7
14. (take_image satellite1 star7 instrument2 image0)
   added: (have_image star7 image0)
   goals met: 3 of 7
15. (turn_to satellite1 phenomenon9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 7
16. (take_image satellite0 star5 instrument0 infrared2)
   added: (have_image star5 infrared2)
   goals met: 4 of 7
17. (take_image satellite1 phenomenon9 instrument2 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 5 of 7
18. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 7
19. (turn_to satellite1 phenomenon6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon6)
   goals met: 5 of 7
20. (take_image satellite1 phenomenon6 instrument2 spectrograph1)
   added: (have_image phenomenon6 spectrograph1)
   goals met: 6 of 7
21. (turn_to satellite1 phenomenon4 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon4)
   goals met: 7 of 7
